package com.company.loops;

//Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
public class task_6 {

    public static void main(String[] args) {
        char c = 'a';
        int ascii = (int) c;
        System.out.println("Численное значение " + c + " в памяти компьютера: " + ascii);
    }
}
