package com.company;

//Создать консольное приложение, удовлетворяющее следующим требованиям:
//• Корректно спроектируйте и реализуйте предметную область задачи.
//• Для создания объектов из иерархии классов продумайте возможность использования порождающих шаблонов
//проектирования.(прочитал, не придумал применение).
//• Реализуйте проверку данных, вводимых пользователем, но не на стороне клиента.
//• для проверки корректности переданных данных можно применить регулярные выражения.
//• Меню выбора действия пользователем можно не реализовывать, используйте заглушку.
//• Особое условие: переопределите, где необходимо, методы toString(), equals() и hashCode().

//Вариант B. Подарки. Реализовать приложение, позволяющее создавать подарки (объект, представляющий собой
//подарок). Составляющими целого подарка являются сладости и упаковка.
public class Main {

    public static void main(String[] args) {
        Sweets sweets1 = new Sweets("Леденцы");
        Present present1 = new Present("Бумага", sweets1, 1);
        Sweets sweets2 = new Sweets("Конфеты");
        Present present2 = new Present("Полиэтилен", sweets2, 2);
        System.out.println(present1.toString());
        System.out.println(present2.toString());
    }
}