package com.company;

//Попробуйте решить данную задачу хотя бы на 50%.
//Задание 3: создайте клиент-серверное приложение “Архив”.
//Общие требования к заданию:
//• В архиве хранятся Дела (например, студентов). Архив находится на сервере.
//• Клиент, в зависимости от прав, может запросить дело на просмотр, внести в
//него изменения, или создать новое дело.
//Требования к коду лабораторной работы:
//• Для реализации сетевого соединения используйте сокеты.
//• Формат хранения данных на сервере – xml-файлы.
public class Main {

    public static void main(String[] args) {
        //Запустите класс Server, затем Client
        //логины и пароли хранятся в файле "auth.txt"
        //пароль от user 54321, от admin 12345
    }
}